# Tap Dump
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# General brew
brew "coreutils"
brew "gnu-sed"
brew "htop"
brew "cmake"
brew "telnet"
brew "git"
brew "pass"
brew "wget"
brew "openssl"
brew "tree"
brew "jq"

# General programs
# cask "slack"
# cask "google-chrome"
cask "postman" # API Client
cask "visual-studio-code" # Code editor

# Python
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"

# JavaScript
brew 'fnm'

# Terminal
cask "kitty" # NeoVim terminal
cask "warp" # Unix terminal
brew "pinentry-mac" # A GUI pinentry program. Browerpass can't trigger a cli version


cask "spotify" # music player
cask "mimestream" # mail client

# All dependencies below are critical for the dotfiles config
brew "neovim" # Main Editor
brew "vim" # Secondary Editor
brew "fzf" # Search
brew "ripgrep" # Search
brew "zsh" # Shell
brew 'exa' # Better ls
brew 'ccat' # Better cat support (colors and such)
cask "font-hack-nerd-font"

brew "direnv" # Join env on dir
brew "gh" # GitHub cli
brew "kubectx"
brew "postgresql@11" # Postgresql service

cask "google-cloud-sdk" # Google cloud sdk
