# Tap Dump
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "mongodb/brew"
tap "sambadevi/powerlevel9k"

# Brew
brew "coreutils"
brew "htop"
brew "unrar"
brew "hub"
brew "cmake"
brew "telnet"
brew "exa"
brew "ccat"
brew "git"
brew "neofetch"
brew "pass"
brew "wget"
brew "ripgrep"
brew "openssl"
brew "stow"
brew "arp-scan"
brew "tree"
brew "unrar"
brew "powerlevel9k"

brew "vim"
brew "nvim"
brew "fzf"
brew "ripgrep"
brew "zsh"

brew "python@2"
brew "python@3"
brew "pyenv"
brew "pyenv-virtualenv"

brew "go"
brew "kubernetes-cli"

brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "mongodb-community", restart_service: true
brew "sqlite"

brew "node"
brew "yarn"
brew "nvm"

# Cask
cask "font-hack-nerd-font"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "kitty"
cask "postman"
cask "mongodb-compass"
