# Tap Dump
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "mongodb/brew"

# Brew
brew "coreutils"
brew "htop"
brew "unrar"
brew "hub"
brew "cmake"
brew "telnet"
brew "exa"
brew "ccat"
brew "git"
brew "neofetch"
brew "pass"
brew "amar1729/formulae/browserpass"
brew "wget"
brew "ripgrep"
brew "openssl"
brew "stow"
brew "arp-scan"
brew "tree"
brew "unrar"
brew "powerlevel9k"
brew "sshuttle"
brew "pinentry-mac"

brew "asdf"

brew "fzf"
brew "ripgrep"
brew "zsh"

brew "virt-manager"
brew "virt-viewer"

brew "python@2"
brew "python@3"

brew "go"
brew "kubernetes-cli"

# Cask
cask "font-hack-nerd-font"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "kitty"
cask "postman"
cask "mongodb-compass"
cask "minikube"
cask "mactex-no-gui"
cask "menumeters"
cask "visual-studio-code"
